{
    "_comment": "จัดการตำแหน่งงานที่นี่ | status: 'open' เปิดแสดงผล, 'close' ปิดแสดงผล",
    "ENGINEERING": [
        {
            "status": "open",
            "dept": {
                "th": "วิศวกรรม",
                "en": "Engineering"
            },
            "title": {
                "th": "วิศวกรเขียนโปรแกรม PLC",
                "en": "PLC Programmer"
            },
            "experience": {
                "th": "1-3 ปี",
                "en": "1-3 years"
            },
            "education": {
                "th": "ปริญญาตรี วิศวกรรมไฟฟ้า หรือที่เกี่ยวข้อง",
                "en": "Bachelor's degree in Electrical Engineering or related field"
            },
            "salary": {
                "th": "25,000 - 45,000 บาท",
                "en": "25,000 - 45,000 THB"
            },
            "location": {
                "th": "กรุงเทพฯ / สมุทรปราการ",
                "en": "Bangkok / Samut Prakan"
            },
            "type": {
                "th": "งานประจำ",
                "en": "Full-time"
            },
            "desc": {
                "th": [
                    "ออกแบบและเขียนโปรแกรมโครงสร้างระบบควบคุม PLC สำหรับเครื่องจักรและระบบอัตโนมัติ",
                    "พัฒนาหน้าจอแสดงผล HMI และระบบ SCADA เพื่อการตรวจสอบและควบคุมกระบวนการผลิต",
                    "ดำเนินการทดสอบระบบ (Commissioning) ณ หน้างานโครงการเพื่อให้ระบบทำงานได้อย่างถูกต้อง",
                    "แก้ไขปัญหาเบื้องต้น (Troubleshooting) และปรับปรุงระบบการทำงานของเครื่องจักรเดิมให้มีประสิทธิภาพสูงขึ้น",
                    "ประสานงานกับทีมวิศวกรออกแบบเครื่องกล เพื่อให้ระบบควบคุมทำงานสอดคล้องกับกลไกของเครื่องจักร",
                    "จัดทำเอกสารคู่มือการใช้งานระบบควบคุมและรายงานการทดสอบระบบ"
                ],
                "en": [
                    "Design and develop PLC control structures for custom machines and industrial automation systems.",
                    "Develop HMI interfaces and SCADA systems for real-time monitoring and process control.",
                    "Perform on-site commissioning to ensure automation systems operate according to technical specifications.",
                    "Troubleshoot complex control issues and optimize existing machine sequences for better performance.",
                    "Collaborate with mechanical design engineers to align control logic with machine kinematics.",
                    "Prepare technical documentation, user manuals, and detailed commissioning reports."
                ]
            }
        }
    ],
    "R_AND_D": [
        {
            "status": "open",
            "dept": {
                "th": "วิจัยและพัฒนา",
                "en": "R&D"
            },
            "title": {
                "th": "วิศวกรออกแบบเครื่องจักร",
                "en": "Mechanical Design Engineer"
            },
            "experience": {
                "th": "2 ปีขึ้นไป",
                "en": "2+ years"
            },
            "education": {
                "th": "ปริญญาตรี วิศวกรรมเครื่องกล",
                "en": "Bachelor's degree in Mechanical Engineering"
            },
            "salary": {
                "th": "30,000 - 55,000 บาท",
                "en": "30,000 - 55,000 THB"
            },
            "location": {
                "th": "กรุงเทพฯ",
                "en": "Bangkok"
            },
            "type": {
                "th": "งานประจำ",
                "en": "Full-time"
            },
            "desc": {
                "th": [
                    "วิเคราะห์ความต้องการของลูกค้าและเปลี่ยนเป็นคอนเซปต์การออกแบบเครื่องจักร",
                    "ออกแบบโครงสร้าง 3D Model และจัดเตรียมแบบสั่งผลิต (2D Drawing) โดยละเอียด",
                    "คัดเลือกอุปกรณ์มาตรฐานที่เกี่ยวข้อง เช่น Pneumatic, Motor, Sensor และอุปกรณ์ส่งกำลัง",
                    "ควบคุมดูแลขั้นตอนการประกอบเครื่องจักรต้นแบบ และทดสอบการทำงานร่วมกับทีมผลิต",
                    "วิเคราะห์ความแข็งแรงของโครงสร้าง (FEA) และคำนวณ Cycle Time ของกระบวนการทำงาน"
                ],
                "en": [
                    "Analyze client requirements and translate them into practical machine design concepts.",
                    "Develop detailed 3D models and precise 2D engineering drawings for manufacturing.",
                    "Select standard components including pneumatics, motors, sensors, and power transmission parts.",
                    "Supervise prototype assembly and conduct operational testing with the production team.",
                    "Perform structural analysis (FEA) and calculate process cycle times for efficiency."
                ]
            }
        }
    ],
    "SOFTWARE": [
        {
            "status": "open",
            "dept": {
                "th": "ซอฟต์แวร์",
                "en": "Software"
            },
            "title": {
                "th": "นักพัฒนา Full-Stack AI",
                "en": "AI Full-Stack Developer"
            },
            "experience": {
                "th": "0-2 ปี",
                "en": "0-2 years"
            },
            "education": {
                "th": "ปริญญาตรี วิศวกรรมคอมพิวเตอร์ หรือวิทยาการคอมพิวเตอร์",
                "en": "Bachelor's degree in Computer Engineering or Computer Science"
            },
            "salary": {
                "th": "ตามประสบการณ์",
                "en": "Based on Experience"
            },
            "location": {
                "th": "Remote / กรุงเทพฯ",
                "en": "Remote / Bangkok"
            },
            "type": {
                "th": "งานประจำ",
                "en": "Full-time"
            },
            "desc": {
                "th": [
                    "พัฒนาแอปพลิเคชันเว็บและแพลตฟอร์ม Cloud สำหรับระบบวิเคราะห์ข้อมูลโรงงานอัจฉริยะ",
                    "เชื่อมต่อระบบซอฟต์แวร์เข้ากับอุปกรณ์ IoT และฐานข้อมูลในระบบอุตสาหกรรม",
                    "ออกแบบและติดตั้งระบบประมวลผล Computer Vision สำหรับการตรวจสอบคุณภาพ (Quality Inspection)",
                    "พัฒนา Dashboard สำหรับแสดงผลกราฟข้อมูลแบบเรียลไทม์ และระบบแจ้งเตือนผ่านช่องทางต่างๆ",
                    "ศึกษาวิจัยและนำอัลกอริทึม Machine Learning มาปรับใช้ เพื่อเพิ่มประสิทธิภาพการผลิต"
                ],
                "en": [
                    "Develop web applications and cloud platforms for smart factory data analytics.",
                    "Integrate software systems with IoT devices and industrial-grade databases.",
                    "Design and implement Computer Vision systems for automated quality inspection.",
                    "Create real-time data visualization dashboards and multi-channel notification systems.",
                    "Research and deploy Machine Learning algorithms to optimize manufacturing throughput."
                ]
            }
        }
    ]
}